In [1]:
import pandas as pd

In [2]:
k={'Name':['a','b','c','c','a','e'],'Age':[10,8,7,5,10,4],'Math':[15,10,12,6,15,15],'Science':[20,20,20,20,20,20],'English':[19,18,18,18,19,18]}

In [3]:
x=pd.DataFrame(k)

In [4]:
x

  Name  Age  Math  Science  English
0    a   10    15       20       19
1    b    8    10       20       18
2    c    7    12       20       18
3    c    5     6       20       18
4    a   10    15       20       19
5    e    4    15       20       18

In [5]:
x.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [6]:
x.drop_duplicates(keep='first')

  Name  Age  Math  Science  English
0    a   10    15       20       19
1    b    8    10       20       18
2    c    7    12       20       18
3    c    5     6       20       18
5    e    4    15       20       18